//
//  TTCViewModel.m
//  TerrableTCellMode
//
//  Created by 肖冯敏 on 2021/8/27.
//

#import "TTCViewModel.h"

@interface TTCViewModel()

@property (nonatomic, strong) NSArray *baseDataList;
@property (nonatomic, assign) NSInteger index;

@end

@implementation TTCViewModel

- (instancetype)init
{
    self = [super init];
    if (self) {
        NSArray *dataList = @[
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"content":@"我是正文",
            },
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文",
            },
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"date":@"2021-01-01",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文",
            },
            @{
                @"title":@"我是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长标题",
                @"avatar":@"Avatar",
                @"date":@"2021-01-01",
                @"rightBtn":@"关注",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文",
            },
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"date":@"2021-01-01",
                @"rightBtn":@"关注",
                @"content":@"我是正文我是正文我是正是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文",
            },
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"date":@"2021-01-01",
                @"rightBtn":@"关注",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是文",
                @"contentImg":@"Avatar",
            },
            @{
                @"title":@"我是标题",
                @"avatar":@"Avatar",
                @"rightBtn":@"关注",
                @"date":@"2021-01-01",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正",
                @"contentImg":@"Avatar",
                @"topic":@"我是一个话题",
            },
            @{
                @"title":@"我是标题",
                @"date":@"2021-01-01",
                @"avatar":@"Avatar",
                @"rightBtn":@"关注",
                @"content":@"我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文我是正文",
                @"contentImg":@"Avatar",
                @"topic":@"我是一个话题",
                @"ext":@"我也不知道我是啥",
            },
        ];
        _baseDataList = dataList;
    }
    return self;
}

- (NSArray *)nextPageData {
    self.index ++;
    if (self.index >= self.baseDataList.count) {
        self.index = 1;;
    } else {
        //donothing
    }
    NSRange range = NSMakeRange(0, self.index);
    return [self.baseDataList subarrayWithRange:range];
}

@end
